In [26]:
from jeda import Jeda
import pandas as pd
import numpy as np
import seaborn as sns

In [27]:
titanic = sns.load_dataset("titanic")

In [41]:
df = titanic[['sex','age','sibsp','parch','fare','class','deck','embark_town','alive']].copy()

In [42]:
df['rand'] = np.random.choice(range(11),len(df))

In [62]:
j = Jeda(data=df)
j

Jeda(columns=[{'name': 'sex', 'type': 'discrete', 'na': 0, 'values': ['female', 'male'], 'counts': [314, 577],…

In [61]:
j.data = sns.load_dataset('diamonds')

In [63]:
j.data

        sex   age  sibsp  parch     fare   class deck  embark_town alive  rand
0      male  22.0      1      0   7.2500   Third  NaN  Southampton    no     1
1    female  38.0      1      0  71.2833   First    C    Cherbourg   yes     2
2    female  26.0      0      0   7.9250   Third  NaN  Southampton   yes     8
3    female  35.0      1      0  53.1000   First    C  Southampton   yes     2
4      male  35.0      0      0   8.0500   Third  NaN  Southampton    no     4
..      ...   ...    ...    ...      ...     ...  ...          ...   ...   ...
886    male  27.0      0      0  13.0000  Second  NaN  Southampton    no     3
887  female  19.0      0      0  30.0000   First    B  Southampton   yes     9
888  female   NaN      1      2  23.4500   Third  NaN  Southampton    no     7
889    male  26.0      0      0  30.0000   First    C    Cherbourg   yes     4
890    male  32.0      0      0   7.7500   Third  NaN   Queenstown    no     5

[891 rows x 10 columns]

In [66]:
df.age.value_counts().sort_index().head(50)

0.42      1
0.67      1
0.75      2
0.83      2
0.92      1
1.00      7
2.00     10
3.00      6
4.00     10
5.00      4
6.00      3
7.00      3
8.00      4
9.00      8
10.00     2
11.00     4
12.00     1
13.00     2
14.00     6
14.50     1
15.00     5
16.00    17
17.00    13
18.00    26
19.00    25
20.00    15
20.50     1
21.00    24
22.00    27
23.00    15
23.50     1
24.00    30
24.50     1
25.00    23
26.00    18
27.00    18
28.00    25
28.50     2
29.00    20
30.00    25
30.50     2
31.00    17
32.00    18
32.50     2
33.00    15
34.00    15
34.50     1
35.00    18
36.00    22
36.50     1
Name: age, dtype: int64